{
  "institution_name": "CAE Malaysia (Pusat Latihan Pasifik)",
  "institution_country": "Malaysia",
  "institution_type": "Private",
  "world_rank": null,
  "malaysia_rank": null,
  "institution_images": [
    "https://s3-ap-southeast-1.amazonaws.com/s3.prod.public.ue.intl/unienrol.com/campus/v2/CAE+Malaysia/Pusat+Latihan+Asia+Pasifik%2C+Puchong/Activities+and+Lifestyle/01a_Pusat_Latihan_Asia_Pasifik%2C_Puchong_CAE_Office.jpeg"
  ],
  "programs": [
    {
      "program_name": "Advanced Certification in Special Education",
      "field_of_study": "Education",
      "location": "CAE PLAP, Puchong",
      "intakes": [
        "Jan",
        "Apr",
        "Jul",
        "Oct"
      ],
      "program_duration_years": 1,
      "internship": null,
      "entry_requirements_raw": {
        "SPM": "Candidates with a pass in SPM may be considered and additional bridging courses may be required..  Additional requirement: more than 5 years working experience with children",
        "Diploma": "Preferably a diploma holder."
      },
      "english_requirements": {},
      "fees": {
        "registration_fee": 480,
        "resource_fee": null,
        "tuition_fee": 12650
      },
      "course_content": {
        "core": "Module 1: Special Education and Exceptional Children\nThis module studies the different types of exceptional children, which include intellectual, emotional, and physical disabilities. The module will provide students with an understanding of special needs education, the different programmes and specialties as well as the educational support framework. Module 1: Special Education and Exceptional Children Module 2: Diagnosis, Assessment and Referral of Exceptional Children\nThis module will have information on the principles and guidance strategies as applied to the exceptional child. Students will gain knowledge in the diverse range of education and psychological tests applicable to referral, assessment and placement of exceptional children. Students will also be exposed to the roles and responsibilities of the different supporting professionals such as the speech pathologists, psychologists and the occupational pathologists. Emphasis is placed on a unified team approach of differential diagnosis and treatment. Module 2: Diagnosis, Assessment and Referral of Exceptional Children Module 3: Literacy; Numeracy and Social Skills\nThis module will introduce the students to the different theories, research and concepts to educational methods and materials used to help a child develop his literacy, numeracy and daily living skills. Module 3: Literacy; Numeracy and Social Skills Module 4: Behaviour & Classroom Management\nThis module focuses on the development of principles and procedures of behavioural change within the conceptual framework of social learning. The course emphasizes practical application of behavioural modification techniques in classroom settings and everyday situations. Variations discussed include the training of parents and teachers to work with children, the introduction of token learning principles into the home and school, and modification of peer and supervisor behaviour. Module 4: Behaviour & Classroom Management Module 5: Individual Education Plan (IEP) and Intervention Strategies\nThis module focuses on the theories, concepts application and implementation of intervention programmes such as mastery learning, peer tutoring, collaborative teaching, multi sensory learning and assistive technology. In addition, the module will also help student understand the purpose and importance of an IEP. The main focus will be to help students to competently design and implement an IEP for individuals in the following domains: Language and communication, cognitive, social and emotional, fine motor, gross motor and adaptive living skills.\n \nModule 6: Specific Learning Difficulties\nThis module will study the characteristics, identification, evaluation and development of learning procedures for individuals who are normal in intelligence but who are failing to learn because of characteristics consistent with central nervous system dysfunction such as perceptual motor disturbances, languages disorders, academic problems and behaviour control disorders. Students will develop an understanding of common specific learning disabilities such as Dyslexia, Dyscalculia and Dysgraphia. Intervention approaches such as the Hanen approach, Orton-Gillingham and the THRASS approach will be taught. Module 5: Individual Education Plan (IEP) and Intervention Strategies Module 6: Specific Learning Difficulties Module 7: Autism Spectrum Disorders\nThis module will provide the students with an understanding of the theories, diagnosis, characteristics, cognitive processes and issues relating to classical autism, Asperger’s syndrome, Rett’s disorders and PDDNOS. Students will understand the medical aspects and theories and controversies essential to quality programming for students with autism and be able to apply intervention strategies to optimize opportunities for people with autism. Module 7: Autism Spectrum Disorders Module 8: Attention Deficit Disorders\nThis module will provide the students with an introduction to the concept of attention deficit disorders and attention deficit with hyperactive disorder. Students will be familiar with the characteristics, causes, diagnosis, issues and management strategies of individuals with attention deficit disorders and attention deficit with hyperactive disorders. Module 8: Attention Deficit Disorders Module 9: Sensory Integration\nThis module will provide students with an understanding of the theories, diagnosis, characteristics, cognitive processes and issues relating to sensory integration disorder. Intervention strategies to manage sensory disorder will also be covered. Module 9: Sensory Integration Module 10: Communication Disorders\nThe module will provide students with an overview of the various communication disorders likely to be encountered in the classroom; students will be exposed to the roles of a speech pathologist and will examine the principles and teaching methods in order to interact with children with communication disorders. Approaches such as PECS and Makaton will be introduced. Module 10: Communication Disorders Module 11: 30 Hours of Supervised Practicum\nStudents will be attached to special needs school to gain practical experience working with special needs children under supervision. At the end of the attachment, students are required to submit a written report for assessment. Module 11: 30 Hours of Supervised Practicum",
        "elective": "",
        "others": ""
      },
      "program_type": "certificate",
      "entry_requirements_processed": {
        "SPM": [
          {
            "type": "raw",
            "text": "Candidates with a pass in SPM may be considered and additional bridging courses may be required..  Additional requirement: more than 5 years working experience with children"
          }
        ],
        "Diploma": [
          {
            "type": "raw",
            "text": "Preferably a diploma holder."
          }
        ]
      },
      "course": "Special Needs Education"
    },
    {
      "program_name": "Certification in Disability Studies",
      "field_of_study": "Education",
      "location": "CAE PLAP, Puchong",
      "intakes": [
        "Jan",
        "Apr",
        "Jul",
        "Oct"
      ],
      "program_duration_years": 0,
      "internship": null,
      "entry_requirements_raw": {
        "SPM": "SPM with a pass in BM and Sejarah. No credits required. Preferably with 1 year working experience."
      },
      "english_requirements": {},
      "fees": {
        "registration_fee": 480,
        "resource_fee": null,
        "tuition_fee": 8500
      },
      "course_content": {
        "core": "Module 1: Specific Learning Difficulties\nThis module will study the characteristics, identification, evaluation and development of learning procedures for individuals who are normal in intelligence but who are failing to learn because of characteristics consistent with central nervous system dysfunction such as perceptual motor disturbances, languages disorders, academic problems and behaviour control disorders. Students will develop an understanding of common specific learning disabilities such as Dyslexia, Dyscalculia and Dysgraphia. Intervention approaches such as the Hanen approach, Orton-Gillingham and the THRASS approach will be taught.\n\nModule 2: Autism Spectrum Disorders\nThis module will provide the students with an understanding of the theories, diagnosis, characteristics, cognitive processes, and issues relating to classical autism, Asperger’s syndrome, Rett’s disorders and PDDNOS. Students will understand the medical aspects and theories and controversies essential to quality programming for students with autism and be able to apply intervention strategies to optimize opportunities for people with autism. Module 1: Specific Learning Difficulties Module 2: Autism Spectrum Disorders Module 3: Attention Deficit Disorders\nThis module will provide the students with an introduction to the concept of attention deficit disorders and attention deficit with hyperactive disorder. Students will be familiar with the characteristics, causes, diagnosis, issues and management strategies of individuals with attention deficit disorders and attention deficit with hyperactive disorders. Module 3: Attention Deficit Disorders Module 4: Sensory Integration\nThis module will provide students with an understanding of the theories, diagnosis, characteristics, cognitive processes and issues relating to sensory integration disorder. Intervention strategies to manage sensory disorder will also be covered. Module 4: Sensory Integration Module 5: Communication Disorders\nThe module will provide students with an overview of the various communication disorders likely to be encountered in the classroom; students will be exposed to the roles of a speech pathologist and will examine the principles and teaching methods in order to interact with children with communication disorders. Approaches such as PECS and Makaton will be introduced. Module 5: Communication Disorders",
        "elective": "",
        "others": ""
      },
      "program_type": "certificate",
      "entry_requirements_processed": {
        "SPM": [
          {
            "type": "subjects",
            "comparator": ">=",
            "count": 2
          },
          {
            "type": "raw",
            "text": "SPM with a pass in BM and Sejarah. No credits required. Preferably with 1 year working experience."
          }
        ]
      },
      "course": "Special Needs Education"
    },
    {
      "program_name": "Certification in Learning Disorders Management and Child Psychology",
      "field_of_study": "Education",
      "location": "CAE PLAP, Puchong",
      "intakes": [
        "Jan",
        "Apr",
        "Jul",
        "Oct"
      ],
      "program_duration_years": 0,
      "internship": null,
      "entry_requirements_raw": {
        "SPM": "SPM with a pass in BM and Sejarah. No credits required. Preferably with 1 year working experience."
      },
      "english_requirements": {},
      "fees": {
        "registration_fee": 480,
        "resource_fee": null,
        "tuition_fee": 8700
      },
      "course_content": {
        "core": "MODULE 1 : Learning Disorders Management Foundation to Special Needs\nThis module introduces the diverse needs of exceptional children. It focuses onto 4 common learning disorders: Autism Spectrum Disorders, Attention Deficit Disorders, Dyslexia and Dyspraxia. Students will understand the theories, characteristics and issues concerning these learning disorders. Foundation to Special Needs Intervention Strategies\nThis module will go into the different intervention strategies applied for the different disorders covered in the Foundation to Special Needs. Students will have an in-depth understanding of the strengths, limitations, and applications of each of the different intervention strategies. Intervention Strategies MODULE 2 : Speech and Language Development Theories and Practice ( 1 ) & ( 2 )\nStudents will understand the importance of speech and language and be introduced to the functions of the speech organs. The module will then go on to train the teachers in areas of applied linguistics topics such as phonetics and phonology.\n  \nMODULE 3 : Child Psychology Theories and Practice ( 1 ) & ( 2 ) MODULE 3 : Child Psychology Theories of Child Development\nThis module covers the basics of how we get our knowledge and information about children - how research on children’s behaviour is conducted. It includes the ideas and principles – the major developmental theories - that we use to explain children’s behaviour and structure our information about them. Theories of Child Development Developmental Stages and Processes\nThis module covers the developmental stages of a child from age 0 - 12. It focuses on the major milestones of developments in areas of cognitive development, language and literacy development, physical development, social and emotional development. Developmental Stages and Processes MODULE 4 : Counselling Counselling Theories\nThis module will cover the importance and functions of counselling. Students will acquire knowledge in the history, concepts, strengths and limitations of the different models of psychotherapy. Counselling Theories Counselling Skills\nThis module covers the basics skills and ethics in counselling. It includes the key attributes of a counsellor and trains the students to have skills in active listening, attending and problems solving in relation to counselling. Students will also be practicing techniques from the Egan’s model and applications of psychotherapy for children. Counselling Skills MODULE 5 : Attachment\nStudents will be attached to special needs school to gain practical experience working with special needs children under supervision. MODULE 5 : Attachment",
        "elective": "",
        "others": ""
      },
      "program_type": "certificate",
      "entry_requirements_processed": {
        "SPM": [
          {
            "type": "subjects",
            "comparator": ">=",
            "count": 2
          },
          {
            "type": "raw",
            "text": "SPM with a pass in BM and Sejarah. No credits required. Preferably with 1 year working experience."
          }
        ]
      },
      "course": "Special Needs Education"
    },
    {
      "program_name": "Certification in Education (Special Needs)",
      "field_of_study": "Education",
      "location": "CAE PLAP, Puchong",
      "intakes": [
        "Jan",
        "Apr",
        "Jul",
        "Oct"
      ],
      "program_duration_years": 0,
      "internship": null,
      "entry_requirements_raw": {
        "SPM": "SPM with a pass in BM and Sejarah. No credits required. Preferably with 1 year working experience."
      },
      "english_requirements": {},
      "fees": {
        "registration_fee": 480,
        "resource_fee": null,
        "tuition_fee": 8500
      },
      "course_content": {
        "core": "Module 1: Special Education and Exceptional Children\nThis module studies the different types of exceptional children, which include intellectual, emotional, and physical disabilities. The module will provide students with an understanding of special needs education, the different programmes and specialties as well as the educational support framework. Module 1: Special Education and Exceptional Children Module 2: Diagnosis, Assessment and Referral of Exceptional Children\nThis module will have information on the principles and guidance strategies as applied to the exceptional child. Students will gain knowledge in the diverse range of education and psychological tests applicable to referral, assessment and placement of exceptional children. Students will also be exposed to the roles and responsibilities of the different supporting professionals such as the speech pathologists, psychologists and the occupational pathologists. Emphasis is placed on a unified team approach of differential diagnosis and treatment.\nModule 3: Literacy; Numeracy and Social Skills\nThis module will introduce the students to the different theories, research and concepts to educational methods and materials used to help a child develop his literacy, numeracy and daily living skills. Module 2: Diagnosis, Assessment and Referral of Exceptional Children Module 4: Behaviour & Classroom Management\nThis module focuses on the development of principles and procedures of behavioural change within the conceptual framework of social learning. The course emphasizes practical application of behavioural modification techniques in classroom settings and everyday situations. Variations discussed include the training of parents and teachers to work with children, the introduction of token learning principles into the home and school, and modification of peer and supervisor behaviour. Module 4: Behaviour & Classroom Management Module 5: Individual Education Plan (IEP) and Intervention Strategies\nThis module focuses on the theories, concepts application and implementation of intervention programmes such as mastery learning, peer tutoring, collaborative teaching, multi sensory learning and assistive technology. In addition, the module will also help student understand the purpose and importance of an IEP. The main focus will be to help students to competently design and implement an IEP for individuals in the following domains: Language and communication, cognitive, social and emotional, fine motor, gross motor and adaptive living skills. Module 5: Individual Education Plan (IEP) and Intervention Strategies",
        "elective": "",
        "others": ""
      },
      "program_type": "certificate",
      "entry_requirements_processed": {
        "SPM": [
          {
            "type": "subjects",
            "comparator": ">=",
            "count": 2
          },
          {
            "type": "raw",
            "text": "SPM with a pass in BM and Sejarah. No credits required. Preferably with 1 year working experience."
          }
        ]
      },
      "course": "Special Needs Education"
    }
  ]
}