{
    "institution_name": "International Schools Partnership (ISP)",
    "institution_country": null,
    "institution_type": null,
    "world_rank": null,
    "malaysia_rank": null,
    "programs": [
        {
            "program_name": "A-Level",
            "field_of_study": "A-Level",
            "location": "ISP Tenby Setia Eco Park School",
            "intakes": [
                "Aug"
            ],
            "program_duration_years": 1,
            "internship": null,
            "entry_requirements_raw": {},
            "english_requirements": {
                "IELTS": "5.0",
                "IGCSE English": "C",
                "SPM 1119 English": "C"
            },
            "fees": {
                "registration_fee": 1600,
                "resource_fee": 6930,
                "tuition_fee": 64000
            },
            "course_content": {
                "core": "A-Level Structure 5 term course – August to July (Year 12) and August to final exams in May/June (Year 13)\nAll subjects except Further Maths students, Art, DT, PE: AS Level exams in June of Year 12 followed by full A Level exams in June of Year 13. \nArt, DT, PE – 1 set of exams at end of Year 13 with additional coursework components in Year 12 and Year 13. \nFurther Maths students take Maths full A Level in Year 12 and full Further Maths in Year 13\nStudents choose 3 or 4 AS Level subjects in Year 12, followed by the same 3 or 4 subjects in Year 13.\nAS Level is worth 50% of full A Level, Year 13 A Level exams worth 50% of final full A Level grade. 5 term course – August to July (Year 12) and August to final exams in May/June (Year 13) All subjects except Further Maths students, Art, DT, PE: AS Level exams in June of Year 12 followed by full A Level exams in June of Year 13. Art, DT, PE – 1 set of exams at end of Year 13 with additional coursework components in Year 12 and Year 13. Further Maths students take Maths full A Level in Year 12 and full Further Maths in Year 13 Students choose 3 or 4 AS Level subjects in Year 12, followed by the same 3 or 4 subjects in Year 13. AS Level is worth 50% of full A Level, Year 13 A Level exams worth 50% of final full A Level grade. Subjects Art\nBiology\nChemistry\nComputer Science\nDesign and Technology\nEconomics\nEnglish Literature\nFurther Mathematics\nGeography\nHistory\nMathematics\nPhysics\nPhysical Education A Level\nPsychology\nIPQ (CAIE version of EPQ, equivalent to an AS Level) Art Biology Chemistry Computer Science Design and Technology Economics English Literature Further Mathematics Geography History Mathematics Physics Physical Education A Level Psychology IPQ (CAIE version of EPQ, equivalent to an AS Level)",
                "elective": "",
                "others": ""
            },
            "program_type": "preuniversity",
            "entry_requirements_processed": {}
        },
        {
            "program_name": "NCUK International Foundation Year",
            "field_of_study": "Foundation in Science",
            "location": "ISP Tenby Setia Eco Park School",
            "intakes": [
                "Apr"
            ],
            "program_duration_years": 0,
            "internship": null,
            "entry_requirements_raw": {},
            "english_requirements": {
                "IELTS": "5.0",
                "IGCSE English": "C",
                "SPM 1119 English": "C"
            },
            "fees": {
                "registration_fee": 1600,
                "resource_fee": 10500,
                "tuition_fee": 22000
            },
            "course_content": {
                "core": "The programme is taught in two semesters over the nine months and is assessed via examinations (in both semesters) and coursework in the second semester.\n \nThis programme includes skills for success, personal statements coaching, UCAS course finding, application to partner universities with guaranteed placement when the entry requirements are fulfilled. Foundation in Engineering Core Modules\nPhysics\nMathematics\nEnglish\nPlus one of the following\nFurther Mathematics\nChemistry Core Modules\nPhysics\nMathematics\nEnglish Core Modules Physics\nMathematics\nEnglish Physics Mathematics English Plus one of the following\nFurther Mathematics\nChemistry Plus one of the following Further Mathematics\nChemistry Further Mathematics Chemistry Foundation in Science Core Modules\nBiology\nChemistry\nEnglish\nPlus one of the following\nMathematics\nPhysics Core Modules\nBiology\nChemistry\nEnglish Core Modules Biology\nChemistry\nEnglish Biology Chemistry English Plus one of the following\nMathematics\nPhysics Plus one of the following Mathematics\nPhysics Mathematics Physics The NCUK IFY is assessed 30% by Coursework and 70% by examination. All assessments are set and moderated by NCUK.",
                "elective": "",
                "others": ""
            },
            "program_type": "foundation",
            "entry_requirements_processed": {}
        }
    ]
}