[
  {
    "trait": "learning_style",
    "description": "The mode through which the student most effectively processes new information, such as, but are not limited to, seeing visuals, listening to explanations, reading material, hands-on practice, or solving logic-based problems."
  },
  {
    "trait": "motivation",
    "description": "The student's internal or external drivers for academic effort, such as, but are not limited to, learning for personal growth, curiosity, competition, grades, recognition, or career advancement."
  },
  {
    "trait": "goal",
    "description": "The student's desired future role, field of study, or life pursuit such as a desired profession or career."
  },
  {
    "trait": "academic_strengths",
    "description": "Subjects or domains the student excels in or feels naturally drawn to such as, but are not limited to, math, writing, science, design, or creative expression."
  },
  {
    "trait": "decision_driver",
    "description": "The most important factor influencing the student's program or university choice, such as, but are not limited to, affordability, prestige, quality of student life, specific academic strengths, or campus location."
  },
  {
    "trait": "financial_need_level",
    "description": "The degree to which cost and financial constraints affect the student's choices, whether they need heavy aid, moderate support, or have flexibility."
  },
  {
    "trait": "geographic_openness",
    "description": "How open the student is to studying away from home-including within their city, country, or abroad."
  },
  {
    "trait": "personality_orientation",
    "description": "Whether the student tends to recharge through alone time or social interaction, ranging from introverted to extroverted, including ambiverts."
  },
  {
    "trait": "brand_affinity",
    "description": "Specific schools, rankings, or institutional types the student admires based on factors such as, but are not limited to, prestige, values, programs, or personal resonance."
  }
]